#!/bin/bash

# آدرس مخزن گیت‌هاب شما (مطمئن شوید یوزرنیم درست است)
REPO_URL="https://raw.githubusercontent.com/Mtyn5610/Makharej/main"

# رنگ‌بندی برای زیبایی منو
RED='\033[0;31m'
GREEN='\033[0;32m'
CYAN='\033[0;36m'
YELLOW='\033[1;33m'
NC='\033[0m' # No Color

clear
# نمایش لوگوی جیبی‌نو در شروع نصب
echo -e "${CYAN}"
echo "  ██╗██╗██████╗ ██╗███╗   ██╗ ██████╗ "
echo "  ██║██║██╔══██╗██║████╗  ██║██╔═══██╗"
echo "  ██║██║██████╔╝██║██╔██╗ ██║██║   ██║"
echo "  ██║██║██╔══██╗██║██║╚██╗██║██║   ██║"
echo "  ╚█████╔╝██████╔╝██║██║ ╚████║╚██████╔╝"
echo "   ╚════╝ ╚═════╝ ╚═╝╚═╝  ╚═══╝ ╚═════╝ "
echo -e "${YELLOW}      >>> JibiNo Smart Installer <<<${NC}"
echo "-----------------------------------------------"

# ۱. دریافت توکن از کاربر
echo -e "${GREEN}[?]${NC} لطفاً توکن ربات تلگرام خود را وارد کنید:"
read -p "Token: " bot_token

if [ -z "$bot_token" ]; then
    echo -e "${RED}❌ خطا: توکن نمی‌تواند خالی باشد. نصب متوقف شد.${NC}"
    exit 1
fi

# ۲. آماده‌سازی پوشه پروژه
echo -e "\n${CYAN}🚀 در حال ایجاد پوشه پروژه در ~/Makharej...${NC}"
mkdir -p ~/Makharej && cd ~/Makharej

# ۳. دانلود فایل‌های مورد نیاز از گیت‌هاب
echo -e "${YELLOW}📥 در حال دریافت فایل‌های
